In [ ]:
# 1

In [1]:
import numpy as np

data = np.array([1, 2, 3])
print((data ** 50)[1]) 
print(2 ** 50)
print(data.dtype)

0
1125899906842624
int32

In [8]:
data = np.array([1, 2, 3], dtype='int64')
print((data ** 50)[1]) 
print(2 ** 50)

1125899906842624
1125899906842624

In [5]:
data = np.array([1, 2, 3])
print((data ** 100)[1]) 
print(2 ** 100)

0
1267650600228229401496703205376

In [9]:
data = np.array([1, 2, 3], dtype=object)
print((data ** 100)[1]) 
print(2 ** 100)

1267650600228229401496703205376
1267650600228229401496703205376

In [ ]:
# https://docs.scipy.org/doc/numpy-1.13.0/reference/arrays.dtypes.html
# https://stackoverflow.com/questions/28552599/is-there-a-numpy-biginteger

In [ ]:
# 2
# .T changes format?

In [15]:
import numpy as np
import pandas as pd

In [16]:
population_dict = {'California': 38332521,
                  'Texas': 26448193,
                  'New York': 19651127,
                  'Florida': 19552860,
                  'Illinois': 12882135}
population_dict
population = pd.Series(population_dict)
population

California    38332521
Florida       19552860
Illinois      12882135
New York      19651127
Texas         26448193
dtype: int64

In [17]:
area_dict = {'California': 423967, 'New York': 141297,
           'Florida': 170312, 'Illinois': 149995}
area = pd.Series(area_dict)
area

California    423967
Florida       170312
Illinois      149995
New York      141297
dtype: int64

In [18]:
cities= pd.DataFrame({'population': population,
             'area': area})
cities

                area  population
California  423967.0    38332521
Florida     170312.0    19552860
Illinois    149995.0    12882135
New York    141297.0    19651127
Texas            NaN    26448193

In [19]:
cities.T

            California     Florida    Illinois    New York       Texas
area          423967.0    170312.0    149995.0    141297.0         NaN
population  38332521.0  19552860.0  12882135.0  19651127.0  26448193.0

In [20]:
cities['density'] = cities['population'] / cities['area']
cities

                area  population     density
California  423967.0    38332521   90.413926
Florida     170312.0    19552860  114.806121
Illinois    149995.0    12882135   85.883763
New York    141297.0    19651127  139.076746
Texas            NaN    26448193         NaN

In [24]:
cities.T

              California       Florida      Illinois      New York       Texas
area        4.239670e+05  1.703120e+05  1.499950e+05  1.412970e+05         NaN
population  3.833252e+07  1.955286e+07  1.288214e+07  1.965113e+07  26448193.0
density     9.041393e+01  1.148061e+02  8.588376e+01  1.390767e+02         NaN

In [ ]:
# one column - one type, one format

In [ ]:
# 3
# Who cares about indexes?

In [28]:
population_dict = {'California': 38332521,
                   'California': 111111,
                  'Texas': 26448193,
                  'New York': 19651127,
                  'Florida': 19552860,
                  'Illinois': 12882135}
population_dict
population = pd.Series(population_dict)
population

California      111111
Florida       19552860
Illinois      12882135
New York      19651127
Texas         26448193
dtype: int64

In [29]:
data = pd.Series((1,2,3,4), index = ('a','b','a','b'))
data

a    1
b    2
a    3
b    4
dtype: int64

In [30]:
data.loc['a']

a    1
a    3
dtype: int64

In [39]:
x = pd.DataFrame(np.array([[1,2,3],[4,5,6]]),
            columns=['c1', 'c2', 'c3'],
            index=['r1', 'r1'])
x

    c1  c2  c3
r1   1   2   3
r1   4   5   6

In [40]:
x.loc['r1', 'c1']

r1    1
r1    4
Name: c1, dtype: int32

In [42]:
x['ind'] = np.array([1,2])
x

    c1  c2  c3  ind
r1   1   2   3    1
r1   4   5   6    2

In [44]:
x = x.set_index('ind')
x

     c1  c2  c3
ind
1     1   2   3
2     4   5   6

In [45]:
cast = pd.read_csv('data/cast.csv')
cast.head()

,title,year,name,type,character,n
0,Suuri illusioni,1985,Homo $,actor,Guests,22.0
1,Natas es Satan,1977,Ramon 'Cartucho' Pena,actor,Nigth Club Owner,NaN
2,Los tarantos,1963,'El Guisa',actor,Bailaor,25.0
3,Los tarantos,1963,'El Viti',actor,Cantaor,20.0
4,Been Down So Long It Looks Like Up to Me,1971,Murray the 'K',actor,Himself,NaN

In [47]:
c = cast.set_index(['title', 'year']).sort_index()
c.head()

                         name   type         character     n
title year
$     1971  Darrell Armstrong  actor  Associated Press  19.0
      1971      Warren Beatty  actor       Joe Collins   1.0
      1971        Scott Brady  actor             Sarge   5.0
      1971      Arthur Brauss  actor         Candy Man   6.0
      1971         Gert Fr?be  actor        Mr. Kessel   3.0

In [48]:
c.loc[('Sleuth', 1972)]

                           name     type                   character    n
title  year
Sleuth 1972       Michael Caine    actor                 Milo Tindle  2.0
       1972      Alec Cawthorne    actor           Inspector Doppler  3.0
       1972        Teddy Martin    actor      Police Constable Higgs  6.0
       1972  John (II) Matthews    actor  Detective Sergeant Tarrant  4.0
       1972    Laurence Olivier    actor                 Andrew Wyke  1.0
       1972  Eve (III) Channing  actress             Marguerite Wyke  5.0

In [50]:
c = c.reset_index(['title', 'year'])
c.head()

   year               name   type         character     n
0  1971  Darrell Armstrong  actor  Associated Press  19.0
1  1971      Warren Beatty  actor       Joe Collins   1.0
2  1971        Scott Brady  actor             Sarge   5.0
3  1971      Arthur Brauss  actor         Candy Man   6.0
4  1971         Gert Fr?be  actor        Mr. Kessel   3.0